Revit 2027 API
UIDocument.GetOpenUIViews Method
Get a list of all open view windows in the Revit user interface.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<UIView> GetOpenUIViews()
Public Function GetOpenUIViews As IList(Of UIView)
public:
IList<UIView^>^ GetOpenUIViews()
member GetOpenUIViews : unit -> IList<UIView>
Return Value
IList<UIView>
Remarks
A sheet view with an activated viewport will return the view associated with the activated viewport, not the sheet view.
See Also
Reference
UIDocument Class
Autodesk.Revit.UI Namespace